"""
Задача №11
----------------------------------------------------------
Дано натуральное число A > 1. Определите, каким по
счету числом Фибоначчи оно является, то есть
выведите такое число n, что φ(n)=A. Если А не
является числом Фибоначчи, выведите число -1.
----------------------------------------------------------
5 -> 6
4 -> -1
"""
# number = int(input("Write a number: "))
# f1 = f2 = 1
# index = 3
# while number > f2:
#     f1, f2 = f2, f1 + f2
#     index += 1
# print(index if number == f2 else '-1')