# На вход программе подается строка текста.
# Напишите программу, которая выводит на экран символ, который появляется наиболее часто.
# aaaabbc -> a
word = 'sfasfJKlff8'
word.islower()
print(word.islower())
