# На вход программе подается строка текста. 
# Напишите программу, которая выводит на экран символ, который появляется наиболее часто.
# aaaabbc -> a

print("Hi, Gregory!, \"Gojo\" ")
