# На вход программе подается натуральное число nn, а затем nn целых чисел.
# Напишите программу, которая создает из указанных чисел список, затем удаляет все элементы стоящие по нечетным индексам,
# а затем выводит полученный список.

num = int(input())

s = []
res = []
for i in range(num):
    s.append(input())
k = input()
if s
print(s)
print(res)
